geeksville/touchy-pad/firmware/sdkconfig.defaults
# SPDX-License-Identifier: GPL-3.0-or-later
# Common defaults for touchy-pad v2 (all boards).
#
# Per-board overrides (flash size, PSRAM mode, partition CSV, pixel clock,
# etc.) live in boards/<board>/sdkconfig.defaults and are layered on top of
# this file by the top-level CMakeLists.txt.

# ----- Target -----
CONFIG_IDF_TARGET="esp32s3"

# ----- CPU / FreeRTOS -----
# Try to run faster because it helps FPS and my test board was fine...
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# Required by uxTaskGetSystemState() (used by screens.cpp:dump_critical_info).
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# Stage 24.2 — `Screen.active` is a recursive `Widget` (with nested
# `Layout.children`), and nanopb's `pb_release` walks the tree
# recursively at boot to free the version-probe decode of each
# host-uploaded screen. The default 3584-byte main task stack overflows
# during this release for non-trivial screens (observed: a ~415-byte
# encoded screen with one grid + a couple of widgets, on the second file
# in the boot scan, smashes the stack and the device crashes during
# board_init right after screens_init returns). 16 KB gives plenty of
# headroom for arbitrary user-provisioned screens.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Trip a clean panic + backtrace if the main (or any) task ever does
# overflow again, instead of silently corrupting whatever lives below
# the stack.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y

# ----- Console / UART -----
# Primary console: UART0.  This works at boot, before USB enumerates, and
# when no USB host is connected.  The USB-Serial/JTAG controller is disabled
# because it shares the OTG D+/D- pins (GPIO 19/20) with TinyUSB; leaving it
# enabled causes a brief enumeration conflict on power-up.
# A second copy of log output is forwarded to the TinyUSB CDC-ACM interface
# at runtime by calling esp_tusb_init_console() after tinyusb_driver_install().
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=n

# ----- USB (TinyUSB composite: CDC-ACM + HID mouse + custom vendor) -----
CONFIG_TINYUSB_DEBUG_LEVEL=0
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_HID_COUNT=1
# Stage 13: custom vendor interface for the host_api command/response/event
# protocol (see docs/host-api.md). esp_tinyusb derives CFG_TUD_VENDOR from
# this count, which compiles in tud_vendor_* support so we can drive the
# bulk OUT/IN endpoints from host_api.cpp.
CONFIG_TINYUSB_VENDOR_COUNT=1

# ----- LVGL (v9) -----
# Route LVGL's stdlib bindings to libc so esp_heap_caps / newlib are used for
# malloc/memcpy/memset/sprintf (replaces v8's LV_MEM_CUSTOM=y).

# per https://lvgl.io/docs/open/integration/chip_vendors/espressif/tips_and_tricks LVGL speedups
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
# LVGL 9.5 places several draw functions in numbered .iram1.N sections; GCC
# rejects the conflicting attributes when LV_ATTRIBUTE_FAST_MEM_USE_IRAM is
# enabled (compile error -Werror=attributes on lv_draw_sw_blend_to_a8.c).
# Keep the FAST_MEM attribute as a no-op until upstream resolves this.
# CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM is not set
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_30=y
# Stage 20: LVGL POSIX filesystem bridge so host-uploaded image assets
# in /littlefs/from_host/ can back Image / ImageButton widgets.
# 'F' (ASCII 70) is the drive letter; paths look like F:/from_host/<asset>.
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=70
CONFIG_LV_FS_POSIX_PATH="/littlefs"
# Native LVGL .bin decoder: the host converts BMP/PNG/JPEG/GIF/WebP to
# this container before upload (see touchy_pad.lvgl_image.to_lvgl_bin).
# RAM_LOAD=y is REQUIRED for scale/rotation: the SW transform path
# indexes into the full decoded image, but with RAM_LOAD=n the bin
# decoder only feeds line-by-line via get_area_cb, so transforming an
# image renders garbage (random pixels from adjacent file data).
CONFIG_LV_BIN_DECODER_RAM_LOAD=y
# Doesnt increase FPS
# CONFIG_LV_USE_DRAW_SW_ASM=255

# ----- Log -----
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ----- Custom partition table (filename supplied per-board) -----
CONFIG_PARTITION_TABLE_CUSTOM=y

